In [1]:
%load_ext sql


%sql mysql+pymysql://root:root@localhost/first

In [44]:
%%sql
create table employee(
    id int,
    name varchar(100),
    qualification varchar(30),
    salary decimal(10,2),
    hire_date date);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [45]:
%%sql
show tables;
select * from employee;

 * mysql+pymysql://root:***@localhost/first
2 rows affected.
0 rows affected.

[]

In [38]:
%%sql
#alter table employee add dept varchar(100);
#alter table employee modify dept varchar(30);
#alter table employee rename column qualification to designation;
#alter table employee drop column dept;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [39]:
%%sql
#drop table employee;
#drop database first;

#truncate table employee;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [42]:
%%sql
rename table employee to employees;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]